# видеотуториал
https://www.youtube.com/watch?v=Yg5rpke79X4&list=PLg5SS_4L6LYstwxTEOU05E0URTHnbtA0l&index=15

# ===============================================================================================
# GITHUB ACTIONS
# ===============================================================================================
# позволяет автоматизировать Test, Build, Deploy



# для включения автоматизации нужно добавить в репозиторий проекта папку с YAML файлами
.github/workflows/my-pipeline.yml










