# ===================================================================================================================================
# ПОСМОТРЕТЬ ЗАДАНИЯ CRON
# ===================================================================================================================================
# крон хранит задания в 3 местах:

База данных crontab 
# все записи cron пользователя, настроенные вручную


/etc/crontab
/etc/cron.d/
# системные записи cron и записи cron различных пакетов

/etc/cron.hourly
/etc/cron.daily
/etc/cron.weekly
/etc/cron.monthly
# скрипты, которые надо выполнять раз в час, день, неделю и месяц соответственно
# эти папки используются различными пакетами, но вы тоже можете их использовать для своих скриптов



# ===================================================================================================================================
# СОЗДАНИЕ ЗАДАНИЙ CRON
# ===================================================================================================================================
# Минимальная единица времени в cron это минута
# * - любое значение
# crontab.guru - сервис для просмотра времени выполнения

минута(0-59) час(0-23) день(1-31) месяц(1-12) день_недели(0-7) /полный/путь/к/команде

# просмотр заданий
crontab -l                              # текущего пользователя
sudo crontab -u root -l                 # другого пользователя

# создание заданий
# задачи cron разделены по пользователями и выполняются от его имени
crontab -e                              # для текущего пользователя
sudo crontab -u имя_пользователя -e     # для другого пользователя


# ===== ПРИМЕРЫ
* * * * * /usr/local/bin/script.sh             # каждую минуту
0 * * * * /usr/local/bin/script.sh             # каждый час
0,14,29,44 * * * * /usr/local/bin/script.sh    # каждые 15 минут
0/5 * * * * /usr/local/bin/script.sh           # каждые 5 минут
0-10 * * * * /usr/local/bin/script.sh          # каждую минуту первые 10 минут каждого часа
0 6,18 * * * /usr/local/bin/script.sh          # только в 6:00 и 18:00
* * * * * /usr/local/bin/script.sh && sleep 30 && /usr/local/bin/script.sh   # каждые 30 секунд


@reboot                                        # при перезагрузке
@yearly, @annually                             # раз в год (0 0 1 1 *)
@monthly                                       # раз в месяц (0 0 1 * *)
@weekly                                        # раз в неделю (0 0 * * 0)
@daily, @midnight                              # раз в день в полночь (0 0 * * *)
@hourly                                        # раз в час (0 * * * *)


# ===================================================================================================================================
# LOGS CRON
# ===================================================================================================================================

# cron пишет логи в /var/log/syslog
cat /var/log/syslog | grep CRON


# ===== настройка Cron logs
в файле /etc/rsyslog.d/50-default.conf

# вынос крона в отдельный лог
cron.*				/var/log/cron.log

# запрет писать лог в syslog
*.*;auth,authpriv.none,cron.none	-/var/log/syslog





