# ===================================================================================================================================
# ДАТА И ВРЕМЯ
# ===================================================================================================================================

# посмотреть текущую дату и время можно так:
date                       # Wed Jun 30 11:31:20 UTC 2021
date +"%H:%M %d/%m/%Y"     # 14:09 26/03/2021
date +%Y-%m-%d             # 2021-03-26
date +%H:%M:%S             # 14:36:35
date +%Y-%m-%d_%H:%M:%S    # 2021-03-26_14:36:42


# утилита systemd для просмотра и настройки времени через консоль
timedatectl

# установка времени в timedatectl
sudo timedatectl set-time "2021-03-26 18:09:30"

# параметр меняет формат с 12 на 24 часовой
# в локали en_US по умолчанию используется 12-ти часовой формат, а в ru_RU или en_GB 24-х часовой
LC_TIME в locale

# дата в консоли на русском языке, время в 24-х часовом формате, все остальное на английском
sudo locale-gen ru_RU.UTF-8
sudo update-locale LANG=en_US.UTF-8 LC_TIME="ru_RU.UTF-8"


# ===================================================================================================================================
# НАСТРОЙКА ТАЙМЗОНЫ С ПОМОЩЬЮ — tzselect и timedatectl. СИНХРОНИЗАЦИЯ ВРЕМЕНИ.
# ===================================================================================================================================

# посмотреть все зоны
timedatectl list-timezones

# установка зоны
sudo timedatectl set-timezone Europe/Moscow

# установка зоны в интерактивном режиме
tzselect

# ===== СИНХРОНИЗАЦИЯ времени с помощью ntpdate

# ntpdate принимает адрес сервера точного времени
sudo ntpdate pool.ntp.org

# запускать ntpdate можно с помощью cron, ntp или chrony, компонента systemd — timesyncd.
# проверить наличие установленной ранее синхронизации
# в дистрибутивах с systemd обычно запущена timesyncd с сервером синхронизации ntp.ubuntu.com
timedatectl timesync-status

# запрет ubuntu менять время в bios
sudo timedatectl set-local-rtc 1

