# ===================================================================================================================================
# GPG ШИФРОВАНИЕ
# ===================================================================================================================================
gpg опции файл параметры

-e, --encrypt          # зашифровать данные, с помощью ключа
-с, --symmetric        # зашифровать данные, с помощью пароля
-d, --decrypt          # расшифровать данные, зашифрованные с помощью ключа или пароля

-h                     # вывести справку по утилите
-s, --sign             # создать цифровую подпись, эта опция используется вместе с другими опциями для шифрования
--clearsign            # подписать незашифрованный текст
--verify               # проверить подпись


-k, --list-keys        # вывести доступные ключи
--list-sigs            # вывести доступные подписи
--fingerprint          # вывести все ключи вместе с их отпечатками

--delete-key           # удалить ключ
--delete-secret-key    # удалить секретный ключ
--export               # экспортировать все ключи
--export-secret-keys   # экспортировать все секретные ключи
--import               # импортировать ключи
--send-keys            # отправить ключи на сервер, должен быть указан сервер ключей
--recv-keys            # получить ключи от сервера ключей
--keyserver            # указать сервер ключей
--fetch-keys           # скачать ключи

--gen-key              # создать ключ
--sign-key             # подписать ключ
--passwd               # изменить пароль для ключа


# ===================================================================================================================================
# ШИФРОВАНИЕ ФАЙЛА ПАРОЛЕМ(Симметричный шифр)
# ===================================================================================================================================

gpg -c file.txt     # засшифровать файл
gpg file.gpg        # расшифровать файл



# ===================================================================================================================================
# ШИФРОВАНИЕ С КЛЮЧАМИ(Асимметричный шифр)
# ===================================================================================================================================

# ===== создаем 2 ключа в ~./gnupg
# pubring.gpg - публичный для шифрования доступен всем
# secring.gpg - приватный для расшифровки
# срок действия ключа можно продлить пока он не истечёт
gpg --gen-key                        # обычный режим
gpg --full-generate-key              # интерактивный режим
gpg --full-generate-key --expert     # более подробный режим


# ===== просмотр доступных ключей
gpg --list-keys

# ===== для шифрования на другом компьютере

# экспорт публичного ключа
gpg -a -o gpgkey.asc --export имя_ключа

# передаем на целевое устройство импорт ключа
gpg --import gpgkey.asc

# поменять уровень доверия ключа
gpg --edit-key Username
# для своих ключей можно использовать пункт абсолютно доверяю - 5
gpg> trust

# ===== шифрование файла
gpg -e -r Username имя_файла

# ===== расшифрование файла
gpg -d имя_файла.gpg

# ===== шифрование каталога
tar -cf - mypath | gpg -e -r Username

tar -czf - mypath | gpg -c > mypath.tar.gz.gpg


tar -czf - mypath | gpg -e -r mario

# ===== расшифрование каталога
gpg -d mypath.gpg | tar -xvf

# ===================================================================================================================================
# ПОДПИСИ(ПРОВЕРКА ИДЕНТИЧНОСТИ)
# ===================================================================================================================================

# подписать файл с изменением файла
gpg --sign file.txt


# создать подпись в отдельном файле
# каталоге с файлом появиться файл .sig с подписью
gpg -b file.txt


# проверка подписи
gpg --verify textfile.sig somefile.txt



# ===================================================================================================================================
# IN UBUNTU FROM DOCKER
# ===================================================================================================================================

gpg

gpg: directory '/root/.gnupg' created
gpg: keybox '/root/.gnupg/pubring.kbx' created
gpg: WARNING: no command supplied.  Trying to guess what you mean ...
gpg: Go ahead and type your message ...