
# ===================================================================================================================================
# grep что_ищу где
# ===================================================================================================================================
grep linux ./*                                      # ищет слово везде 
grep -e [A-Za-z\.]*@[A-Za-z]*.gov myfile.txt        # регулярное выражение - ищет email
grep vadim /etc/* 2> /dev/null                      # 2> - перенаправление ошибок в никуда, на эран выведет все без ошибок
grep vadim /etc/* > good.txt 2> errors.txt          # > - перенаправление вывода без ошибок в файл, 2> - перенаправление ошибок в файл
grep vadim /etc/* &> all_results.txt                # &> - сохранить в файл весь вывод с ошибками и без

-i - не учитывать регистр
-c - подсчитать количество вхождений шаблона
-v - инвертировать поиск, выдавать все строки кроме тех, что содержат шаблон
-w - искать шаблон как слово, окружённое пробелами
-e - использовать регулярные выражения при поиске
-b - показывать номер блока перед строкой
-h - не выводить имя файла в результатах поиска внутри файлов Linux
-l - отобразить только имена файлов, в которых найден шаблон
-n - показывать номер строки в файле
-s - не показывать сообщения об ошибках
-An - показать вхождение и n строк до него
-Bn - показать вхождение и n строк после него
-Cn - показать n строк до и после вхождения


# ===================================================================================================================================
# find
# ===================================================================================================================================
find /home -name "*.txt"
find /home -name "file*.txt"


# ===================================================================================================================================
# wc - подсчет параметров файла
# ===================================================================================================================================
wc linux-history.txt       # строчек слов символов

# ===================================================================================================================================
# sort - сортирует файл
# ===================================================================================================================================
sort names.txt


# ===================================================================================================================================
# cut
# ===================================================================================================================================
# выдаст из файла данные между 3 и 4 разделителем >
cut -d ">" -f 3



















