# ==========================================================================================================================
# ssh [опции] имя пользователя@сервер [команда]
# ==========================================================================================================================
# настройки работы ssh можно изменять через конфигурационный файл ~/.ssh/config
# Настройки сервера SSH находятся в файле /etc/ssh/sshd_config. 

f - перевести ssh в фоновый режим;
g - разрешить удаленным машинам обращаться к локальным портам;
l - имя пользователя в системе;
n - перенаправить стандартный вывод в /dev/null;
p - порт ssh на удаленной машине;
q - не показывать сообщения об ошибках;
v - режим отладки;
x - отключить перенаправление X11;
X - включить перенаправление Х11;
C - включить сжатие.


# ==========================================================================================================================
# ГЕНЕРАЦИЯ КЛЮЧЕЙ И ЗАГРУЗКА НА СЕРВЕР
# ==========================================================================================================================

mkdir ~/.ssh                                                         # создаем папку для ключей /root/.ssh
nano ~/.ssh/authorized_keys                                          # файл на сервере для хранения ключей
chmod -u=rwX,go= ~/.ssh                                              # chmod 700
chmod -u=rw,go=r ~/.ssh/authorized_keys                              # chmod 644

ssh-keygen -f ~/.ssh/mysecret_rsa -t rsa -N ''                       # генерация пары ключей
ssh-copy-id -i ~/.ssh/mysecret_rsa.pub root@192.168.112.3            # копирование публичного ключа на другой сервер
ssh-copy-id -i ~/.ssh/mysecret_rsa.pub root@learning_linux_node2_1   # копирование публичного ключа на другой сервер

# для убунту в докере
mkdir -p /run/sshd                                       
service ssh start


# ==========================================================================================================================
# ОГРАНИЧЕНИЕ НА ВХОД НА ФРОНТ СЕРВЕР
# делаем вход на сервер только по ssh юзеру www
# ==========================================================================================================================
https://www.aitishnik.ru/linux/ssh-debian/nastroyka-openssh.html


# файлы конфигов
/etc/ssh/sshd_config          # Глобальные клиентские настройки ко всем пользователям
~/.ssh/config                 # Пользовательские настройки

# добавить в конфиг
# разрешает доступ по SSH только юзеру www
AllowUsers www

# не позволяет юзеру root логиниться на сервер
PermitRootLogin no

# запрет на вход с паролем
PasswordAuthentication no

# затем перезапустить ssh
sudo service ssh restart

# ==========================================================================================================================
# КОПИРОВАНИЕ ФАЙЛОВ ПО SSH
# scp /адрес/локального/файла пользователь@хост:адерс/папки
# ==========================================================================================================================

# передача файла в папку
scp ~/test.txt mario@192.168.0.3:/docs

# передача с сохранением потока в файл
cat ~/test.txt | ssh mario@192.168.0.3 "cat > /docs/test.txt"

# или тоже самое по другому
ssh mario@192.168.0.3 "cat > /docs/test.txt" < ~/test.txt

# передача с архивацией
tar -czf ~/test.txt | ssh mario@192.168.0.3 tar -xvzf -C /docs/


# ==========================================================================================================================
# ТУННЕЛИ SSH
# ssh -L локальный_порт:удаленный_адрес:удаленный_порт пользователь@сервер
# ==========================================================================================================================

# делаем доступной локально удаленную базу
ssh -N -L 5555:127.0.0.1:3306 root@losst-1

-N                        # команду на удалённой машине выполнять не нужно
-L 5555:127.0.0.1:3306    # наш локальный порт:локальный адрес удаленной машины:порт MySQL удаленной машины
       

# делаем локальную базу доступной удаленно
ssh -N -R 5555:127.0.0.1:3306 root@losst-1

-R                        # реверс

