# ===================================================================================================================================
# SWAPFILE
# ===================================================================================================================================

# смотреть информацию  
free -h
swapon --show

# отключить своп перед изменением
sudo swapoff /swapfile

# создать своп
sudo fallocate -l 4G /swapfile

# назначить файл свопом
sudo mkswap /swapfile

# включить своп
sudo swapon /swapfile

